core/ESECCompositeApplication/src/jbiasa/ESECCompositeApplication.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="ESECCompositeApplication"
             xmlns:tns="ESECCompositeApplication" xmlns:ns="http://j2ee.netbeans.org/wsdl/ESECProcess/ESECProcess" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/ESECProcess/ESECProcess" location="../jbiServiceUnits/ESECProcess/ESECProcess.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:ESECProcessPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ESECProcessOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="ESECCompositeApplication"/>
            </input>
            <output name="output1">
                <soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="ESECCompositeApplication"/>
            </output>
        </operation>
    </binding>
    <service name="ESECCompositeApplicationService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/ESECCompositeApplicationService1/casaPort1"/>
        </port>
    </service>
</definitions>

